src/DataProcessors/НастройкаОблако/НастройкаОблако.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>НастройкаОблако</name>
</mdclass:DataProcessor>

src/Catalogs/Пароли/Пароли.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пароли</name>
  <attributes>
    <name>Сервис</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сайт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/НастройкаОблако/Forms/Форма/Module.bsl
&НаСервере
Процедура Команда2НаСервере()
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Запрос", Истина);

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанных);
	СтрокаJSON = ЗаписьJSON.Закрыть();

	Попытка
		HTTPСервис = "doctor-1c.ru";
		Ресурс = "/webhook/cf7c84c4-5b45-446d-92c7-1e9c2dac00fa";
		
		// Использование ЗащищенноеСоединениеOpenSSL для большей совместимости
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
		Соединение = Новый HTTPСоединение(HTTPСервис, , , , , , ЗащищенноеСоединение);

		Запрос = Новый HTTPЗапрос(Ресурс);
		Запрос.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
		Запрос.Заголовки.Вставить("Content-Type", "application/json");

		Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);

		КодСостояния = Ответ.КодСостояния;

		Если КодСостояния >= 200 И КодСостояния < 300 Тогда
	// Успешный ответ
			ТелоОтвета = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);

			Если Не ПустаяСтрока(ТелоОтвета) Тогда
				Попытка
					ЧтениеJSON = Новый ЧтениеJSON;
					ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
					ДанныеОтвета = ПрочитатьJSON(ЧтениеJSON);
					ЧтениеJSON.Закрыть();

					Для Каждого стр Из ДанныеОтвета.data Цикл
						Ссылка = ПолучитьОбъектПоИдентификатору(стр.Идентификатор);

						Если Не Лев(Ссылка, 18) = "<Объект не найден>" Тогда
							ЗаписьОбъект = Ссылка.ПолучитьОбъект();
						Иначе
							ЗаписьОбъект = Справочники.Пароли.СоздатьЭлемент();
							ЗаписьОбъект.УстановитьСсылкуНового(Справочники.Пароли.ПолучитьСсылку(Новый УникальныйИдентификатор(стр.Идентификатор)));
						КонецЕсли;
						ЗаписьОбъект.Наименование = стр.Сервис;
						ЗаписьОбъект.Пароль = стр.Пароль;
						ЗаписьОбъект.Логин = стр.Логин;
						ЗаписьОбъект.Сайт = стр.Сайт;
						ЗаписьОбъект.Описание = стр.Описание;
						ЗаписьОбъект.Записать();

					КонецЦикла;

				Исключение
			// Логируем ошибку некорректного JSON
					ЗаписьЖурналаРегистрации("ОбменССервисом", УровеньЖурналаРегистрации.Ошибка, , ,
						"Ошибка при разборе ответа сервера (JSON): " + ОписаниеОшибки() + Символы.ПС + "Тело ответа: "
						+ ТелоОтвета);
				КонецПопытки;
			КонецЕсли;
		Иначе
	// Ошибка сервера
			ВызватьИсключение "Ошибка при выполнении HTTP-запроса. Код состояния: " + КодСостояния;
		КонецЕсли;
// ...
	Исключение
		// Логирование ошибки или сообщение пользователю
		ЗаписьЖурналаРегистрации("ОбменССервисом", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка при отправке данных: "
			+ ОписаниеОшибки());
		// Если нужно показать сообщение пользователю на клиенте, верните текст ошибки через параметр
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	Команда2НаСервере();
КонецПроцедуры
&НаСервере
Процедура Команда1НаСервере()
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Запрос", Ложь);
	СтруктураДанных.Вставить("Данные", ПолучитьМассивДанных());

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанных);
	СтрокаJSON = ЗаписьJSON.Закрыть();

	Попытка
		HTTPСервис = "doctor-1c.ru";
		Ресурс = "/webhook/cf7c84c4-5b45-446d-92c7-1e9c2dac00fa";
		
		// Использование ЗащищенноеСоединениеOpenSSL для большей совместимости
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
		Соединение = Новый HTTPСоединение(HTTPСервис, , , , , , ЗащищенноеСоединение);

		Запрос = Новый HTTPЗапрос(Ресурс);
		Запрос.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
		Запрос.Заголовки.Вставить("Content-Type", "application/json");

		Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);

		КодСостояния = Ответ.КодСостояния;
		Если КодСостояния >= 200 И КодСостояния < 300 Тогда
			// Успешный ответ
			ТелоОтвета = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			// Здесь можно добавить обработку успешного ответа
		Иначе
			// Ошибка сервера
			ВызватьИсключение "Ошибка при выполнении HTTP-запроса. Код состояния: " + КодСостояния;
		КонецЕсли;

	Исключение
		// Логирование ошибки или сообщение пользователю
		ЗаписьЖурналаРегистрации("ОбменССервисом", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка при отправке данных: "
			+ ОписаниеОшибки());
		// Если нужно показать сообщение пользователю на клиенте, верните текст ошибки через параметр
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивДанных()
	Массив = Новый Массив;
	Выборка = Справочники.Пароли.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Идентификатор", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
		СтруктураДанных.Вставить("Сервис", Выборка.Наименование);
		СтруктураДанных.Вставить("Сайт", Выборка.Сайт);
		СтруктураДанных.Вставить("Логин", Выборка.Логин);
		СтруктураДанных.Вставить("Пароль", Выборка.Пароль);
		СтруктураДанных.Вставить("Описание", Выборка.Описание);

		Массив.Добавить(СтруктураДанных);

	КонецЦикла;

	Возврат Массив;

КонецФункции

&НаСервере
Функция ПолучитьОбъектПоИдентификатору(Идентификатор)

	Возврат Справочники.Пароли.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));

КонецФункции
